## Load Necessary Libraries

In [14]:
import psycopg2
import sqlalchemy
import pandas as pd
import os

## Upload Accounts table using psycopg2

### Read Dataframe

In [3]:
accounts=pd.read_excel('C:/Users/Admin/Desktop/Tables/accounts.xlsx')
accounts.head()

,id,name,website,lat,long,primary_poc,sales_rep_id
0,1001,Walmart,www.walmart.com,40.238496,-75.103297,Tamara Tuma,321500.0
1,1011,Exxon Mobil,www.exxonmobil.com,41.169156,-73.849374,Sung Shields,321510.0
2,1021,Apple,www.apple.com,42.290495,-76.084009,Jodee Lupo,321520.0
3,1031,Berkshire Hathaway,www.berkshirehathaway.com,40.949021,-75.763898,Serafina Banda,321530.0
4,1041,McKesson,www.mckesson.com,42.217093,-75.284998,Angeles Crusoe,321540.0

### Data Preprocessing

#### 1. Check Data Types of Dataframe

In [4]:
accounts.dtypes

id                int64
name             object
website          object
lat             float64
long            float64
primary_poc      object
sales_rep_id    float64
dtype: object

#### 2. Convert data types as required in SQL

In [5]:
replacement={
    'int64':'int',
    'object':'varchar(255)',
    'float64':'numeric'
}

In [7]:
for i in accounts.columns:
    col=accounts.dtypes.replace(replacement)
print(col)

id                       int
name            varchar(255)
website         varchar(255)
lat                  numeric
long                 numeric
primary_poc     varchar(255)
sales_rep_id         numeric
dtype: object

#### 3. Save file in csv format

In [15]:
os.chdir('C:/Users/Admin/Desktop/Tables/New Folder')
accounts.to_csv('accounts.csv',index=False)

### Push Accounts data to Database

In [18]:
# create connection
connection=psycopg2.connect(user='postgres',
                           password='password',
                           host='localhost',
                           port=5432,
                           database='table_joins')
cursor=connection.cursor()
print("Connection Established Successfully")

Connection Established Successfully

In [19]:
# create table in database

cursor.execute('''drop table if exists accounts''')
connection.commit()

cursor.execute('''create table accounts 
               (id                       int,
                name            varchar(255),
                website         varchar(255),
                lat                  numeric,
                long                 numeric,
                primary_poc     varchar(255),
                sales_rep_id         numeric)
                ''')
connection.commit()

In [20]:
# Open accounts.csv file
my_file=open('accounts.csv')

In [21]:
# copy file content to accounts table in database
statement='''copy accounts from stdin with header csv delimiter as ','
'''
cursor.copy_expert(sql=statement,file=my_file)
connection.commit()

### Read file from database

In [24]:
cursor.execute('''select * from accounts''')
connection.commit()

data=cursor.fetchall()

db_accounts=pd.DataFrame(data,columns=[accounts.columns])
db_accounts

,id,name,website,lat,long,primary_poc,sales_rep_id
0,1001,Walmart,www.walmart.com,40.23849561,-75.10329704,Tamara Tuma,321500.0
1,1011,Exxon Mobil,www.exxonmobil.com,41.1691563,-73.84937379,Sung Shields,321510.0
2,1021,Apple,www.apple.com,42.29049481,-76.08400942,Jodee Lupo,321520.0
3,1031,Berkshire Hathaway,www.berkshirehathaway.com,40.94902131,-75.76389759,Serafina Banda,321530.0
4,1041,McKesson,www.mckesson.com,42.21709326,-75.28499823,Angeles Crusoe,321540.0
...,...,...,...,...,...,...,...
346,4461,KKR,www.kkr.com,45.54535285,-122.65524711,Buffy Azure,321970.0
347,4471,Oneok,www.oneok.com,45.51351286,-122.68150011,Esta Engelhardt,321960.0
348,4481,Newmont Mining,www.newmont.com,45.49411669,-122.66946042,Khadijah Riemann,321970.0
349,4491,PPL,www.pplweb.com,45.49172048,-122.67187978,Deanne Hertlein,321960.0
350,4501,SpartanNash,www.spartannash.com,None,None,None,None

## Upload Orders file to Database using sqlalchemy

### Read Dataframe

In [67]:
orders=pd.read_excel("C:/Users/Admin/Desktop/Tables/orders.xlsx")
orders.head()

,id,Account_id,Occurred at,Standard qty,poster_qty,gloss_qty,t$tal,standard/amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1,1001,2015-10-06T17:31:14.000Z,123,22,24,169,613.77,164.78,194.88,973.43
1,2,1001,2015-11-05T03:34:33.000Z,190,41,57,288,948.10,307.09,462.84,1718.03
2,3,1001,2015-12-04T04:21:55.000Z,85,47,0,132,424.15,352.03,0.00,776.18
3,4,1001,2016-01-02T01:18:24.000Z,144,32,0,176,718.56,239.68,0.00,958.24
4,5,1001,2016-02-01T19:27:27.000Z,108,29,28,165,538.92,217.21,227.36,983.49

### Data Preprocessing

#### 1. Check column names and correct if required

In [68]:
orders.columns

Index(['id', 'Account_id', 'Occurred at', 'Standard qty', 'poster_qty',
       'gloss_qty', 't$tal', 'standard/amt_usd', 'gloss_amt_usd',
       'poster_amt_usd', 'total_amt_usd'],
      dtype='object')

In [69]:
replacement={'$':'o',
             '/':'_',
             ' ':'_'
            }

orders.columns=[i.lower().replace("$","o").replace(' ','_').replace('/','_') for i in orders.columns]
orders.columns

Index(['id', 'account_id', 'occurred_at', 'standard_qty', 'poster_qty',
       'gloss_qty', 'total', 'standard_amt_usd', 'gloss_amt_usd',
       'poster_amt_usd', 'total_amt_usd'],
      dtype='object')

In [70]:
orders.columns

Index(['id', 'account_id', 'occurred_at', 'standard_qty', 'poster_qty',
       'gloss_qty', 'total', 'standard_amt_usd', 'gloss_amt_usd',
       'poster_amt_usd', 'total_amt_usd'],
      dtype='object')

#### 2.check data types of each column

In [50]:
orders.dtypes

id                    int64
account_id            int64
occurred_at          object
standard_qty          int64
poster_qty            int64
gloss_qty             int64
total                 int64
standard_amt_usd    float64
gloss_amt_usd       float64
poster_amt_usd      float64
total_amt_usd       float64
dtype: object

#### 3. Change to required SQL Data Types

In [51]:
replacement={
    'int64':'int',
    'float64':'numeric',
    'object':'varchar(255)'
}

In [52]:
for i in orders.columns:
    col=orders.dtypes.replace(replacement)
col

id                           int
account_id                   int
occurred_at         varchar(255)
standard_qty                 int
poster_qty                   int
gloss_qty                    int
total                        int
standard_amt_usd         numeric
gloss_amt_usd            numeric
poster_amt_usd           numeric
total_amt_usd            numeric
dtype: object

###  Split Dataset into 2 groups

In [71]:
orders1=orders.loc[0:3000]
orders1

,id,account_id,occurred_at,standard_qty,poster_qty,gloss_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1,1001,2015-10-06T17:31:14.000Z,123,22,24,169,613.77,164.78,194.88,973.43
1,2,1001,2015-11-05T03:34:33.000Z,190,41,57,288,948.10,307.09,462.84,1718.03
2,3,1001,2015-12-04T04:21:55.000Z,85,47,0,132,424.15,352.03,0.00,776.18
3,4,1001,2016-01-02T01:18:24.000Z,144,32,0,176,718.56,239.68,0.00,958.24
4,5,1001,2016-02-01T19:27:27.000Z,108,29,28,165,538.92,217.21,227.36,983.49
...,...,...,...,...,...,...,...,...,...,...,...
2996,2997,3291,2016-11-09T18:09:43.000Z,69,29,0,98,344.31,217.21,0.00,561.52
2997,2998,3291,2016-12-09T20:43:20.000Z,95,12,38,145,474.05,89.88,308.56,872.49
2998,2999,3301,2016-02-09T07:32:47.000Z,112,22,0,134,558.88,164.78,0.00,723.66
2999,3000,3301,2016-03-09T14:38:49.000Z,118,43,31,192,588.82,322.07,251.72,1162.61
3000,3001,3311,2015-09-02T03:06:00.000Z,524,35,0,559,2614.76,262.15,0.00,2876.91

In [72]:
orders2=orders.loc[3001:]
orders2

,id,account_id,occurred_at,standard_qty,poster_qty,gloss_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
3001,3002,3311,2015-10-01T20:15:25.000Z,503,43,0,546,2509.97,322.07,0.00,2832.04
3002,3003,3311,2015-10-30T09:55:17.000Z,495,13,0,508,2470.05,97.37,0.00,2567.42
3003,3004,3311,2015-11-28T14:28:03.000Z,496,0,21,517,2475.04,0.00,170.52,2645.56
3004,3005,3311,2015-12-28T09:44:55.000Z,504,23,92,619,2514.96,172.27,747.04,3434.27
3005,3006,3311,2016-01-27T20:09:08.000Z,515,21,5,541,2569.85,157.29,40.60,2767.74
...,...,...,...,...,...,...,...,...,...,...,...
6907,6908,4501,2016-06-29T04:03:39.000Z,11,199,59,269,54.89,1490.51,479.08,2024.48
6908,6909,4501,2016-07-29T19:58:32.000Z,5,91,96,192,24.95,681.59,779.52,1486.06
6909,6910,4501,2016-08-27T00:58:11.000Z,16,94,82,192,79.84,704.06,665.84,1449.74
6910,6911,4501,2016-11-22T06:52:22.000Z,63,67,81,211,314.37,501.83,657.72,1473.92
6911,6912,4501,2016-12-21T13:30:42.000Z,61,150,52,263,304.39,1123.50,422.24,1850.13

### Push Data to Database

#### 1. Create SQL connection

In [131]:
connection=psycopg2.connect(user='postgres',
                           password='password',
                           host='localhost',
                           port=5432,
                           database='table_joins')
cursor=connection.cursor()
print("Connection Established Successfully")

Connection Established Successfully

#### 2. Create table in SQL Database

In [132]:
cursor.execute('''drop table if exists orders''')
connection.commit()

cursor.execute('''create table orders
                (id                           int,
                 account_id                   int,
                 occurred_at          timestamptz,
                 standard_qty                 int,
                 poster_qty                   int,
                 gloss_qty                    int,
                 total                        int,
                 standard_amt_usd         numeric,
                 gloss_amt_usd            numeric,
                 poster_amt_usd           numeric,
                 total_amt_usd            numeric)''')
connection.commit()

#### 3. Upload orders1 dataframe to orders table in sql

In [133]:
# create engine
from sqlalchemy import create_engine
engine=create_engine('postgresql://postgres:password@localhost:5432/table_joins')

In [134]:
orders1.to_sql('orders',con=engine,if_exists='append',index=False)

1

#### 4. Upload orders2 dataframe to database table

In [135]:
# create engine
from sqlalchemy import create_engine
engine=create_engine('postgresql://postgres:password@localhost:5432/table_joins')

In [136]:
orders2.to_sql('orders',con=engine,if_exists='append',index=False)

911

### Read Data from database

In [137]:
orders_db=pd.read_sql('select * from orders',engine)
orders_db

,id,account_id,occurred_at,standard_qty,poster_qty,gloss_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1,1001,2015-10-06 17:31:14+00:00,123,22,24,169,613.77,164.78,194.88,973.43
1,2,1001,2015-11-05 03:34:33+00:00,190,41,57,288,948.10,307.09,462.84,1718.03
2,3,1001,2015-12-04 04:21:55+00:00,85,47,0,132,424.15,352.03,0.00,776.18
3,4,1001,2016-01-02 01:18:24+00:00,144,32,0,176,718.56,239.68,0.00,958.24
4,5,1001,2016-02-01 19:27:27+00:00,108,29,28,165,538.92,217.21,227.36,983.49
...,...,...,...,...,...,...,...,...,...,...,...
6907,6908,4501,2016-06-29 04:03:39+00:00,11,199,59,269,54.89,1490.51,479.08,2024.48
6908,6909,4501,2016-07-29 19:58:32+00:00,5,91,96,192,24.95,681.59,779.52,1486.06
6909,6910,4501,2016-08-27 00:58:11+00:00,16,94,82,192,79.84,704.06,665.84,1449.74
6910,6911,4501,2016-11-22 06:52:22+00:00,63,67,81,211,314.37,501.83,657.72,1473.92
6911,6912,4501,2016-12-21 13:30:42+00:00,61,150,52,263,304.39,1123.50,422.24,1850.13

In [138]:
orders_db=pd.read_sql('select total,standard_qty,(total-standard_qty) as remaining from orders',engine)
orders_db

      total  standard_qty  remaining
0       169           123         46
1       288           190         98
2       132            85         47
3       176           144         32
4       165           108         57
...     ...           ...        ...
6907    269            11        258
6908    192             5        187
6909    192            16        176
6910    211            63        148
6911    263            61        202

[6912 rows x 3 columns]